'''
北京市
东城区 西城区 朝阳区 丰台区 石景山区 海淀区 门头沟区 房山区 通州区


上海市
黄浦区 徐汇区 长宁区 静安区 普陀区 虹口区 杨浦区 闵行区 宝山区 嘉定区

广州
荔湾区 越秀区 海珠区 天河区 白云区 黄埔区 番禺区 花都区 南沙区 从化区 增城区

深圳
罗湖区 福田区 南山区 宝安区 龙岗区 盐田区



ChengShi = {'A1':'1.北京市','A2':'2.上海市','A3':'3.广州市','A4':'4.深圳市'}
BeiJing = {'A11':'1.东城区','A12':'2.西城区','A13':'3.朝阳区','A14':'4.丰台区','A15':'5.石景山区','A16':'6.海淀区'}
ShangHai = {'A21':'1.黄浦区','A22':'2.徐汇区','A23':'3.长宁区','A24':'4.静安区','A25':'5.普陀区','A26':'6.虹口区'}
GuangZhou = {'A31':'1.荔湾区','A32':'2.越秀区','A33':'3.海珠区','A34':'4.天河区','A35':'5.白云区','A36':'6.黄埔区'}
ShenZhen = {'A41':'1.罗湖区','A42':'2.福田区','A43':'3.南山区','A44':'4.宝安区','A45':'5.龙岗区','A46':'6.盐田区'}

'''
import os
import sys

DiFang = {
    "北京市":{
        "东城区":{
            "东城区景点1":"东城区景点",
            "东城区景点2":"东城区景点",
            "东城区景点3":"东城区景点"
        },
        "西城区":{
            "西城区景点1":"西城区景点",
            "西城区景点2":"西城区景点",
            "西城区景点3":"西城区景点"
        },
        "朝阳区":{
            "朝阳区景点1":"朝阳区景点",
            "朝阳区景点2":"朝区景点",
            "朝阳区景点3":"朝阳区景点"
        }
    },
    "上海市":{
        "黄浦区":{
            "黄浦区景点1":"黄浦区景点",
            "黄浦区景点2":"黄浦区景点",
            "黄浦区景点3":"黄浦区景点"
        },
        "虹口区":{
            "虹口区景点1":"虹口区景点",
            "虹口区景点2":"虹口区景点",
            "虹口区景点3":"虹口区景点"
        },
        "长宁区":{
            "长宁区景点A":"长宁区景点",
            "长宁区景点B":"长宁区景点",
            "长宁区景点C":"长宁区景点"
        }
    },
    "广州市":{
        "天河区":{
            "天河区景点1":"天河区景点",
            "天河区景点2":"天河区景点",
            "天河区景点3":"天河区景点"
        },
        "白云区":{
            "白云区景点1":"白云区景点",
            "白云区景点2":"白云区景点",
            "白云区景点3":"白云区景点"
        }
    }
}



l1 = False
l2 = False
l3 = False
while True:
    for k in DiFang.keys():
        print(k)
    A = input("请输入要选择的城市：")
    if A == "Q":
        sys.exit(0)
    t2 = False
    while True:
        if t2 == True:
            break
        if A in DiFang.keys():
            for kb in DiFang[A].keys():
                print(kb)

            B = input("请输入要选择的区：")
            if C.isdigit() == True:
                if C == 0:
                    break
            if C.isalpha() == True:
                if C == "Q":
                    t2 = True
                    break
            while True:
                if B in DiFang[A].keys():
                    for kc in DiFang[A][B].keys():
                        print(kc)
                    #os.system("pause")
                    C = input("输入0返回上一层，输入Q退出程序: ")
                    if C.isdigit() == True:
                        if C == 0:
                            break
                    if C.isalpha() == True:
                        if C == "Q":
                            t2 = True
                            break
                    if int(C) == 0 : break
                    if C == "Q" : sys.exit(0)
                else:
                    if int(B) == 0:
                        break
                    break

